/**
 * Copyright (C) 2015  Austin Peterson
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */

// Just so you know, comments aren't valid JSON, so you should probably
// remove any you see laying around.

{
    "productionMode": true, // Disable this in order to make the bot crash on most errors.
    "servers": [
        {
            "server": "kuroi.irc.nolimitzone.com", // IRC server for the bot to connect to.
            "nick": "IRCBot9000", // Nick to use on the IRC server.
            "realname": "IRCBot9000", // Real name to use on the IRC server.
            "username": "IRCBot9000", // User name to use on the IRC server.
            "password": "PasswordGoesHere", // Password the bot should use upon connecting.
            "channels": [ // Channels to connect to.
                {
                    "name": "#botplace", // Name of the channel.
                    "users": [ // Users on the channel.
                        {
                            "nick": "Nick",
                            "hostmask": "Nick!User@hostname.com",// Users are defined by hostmasks (only full hostmasks allowed for now), and have permissions.
                            "permissions": ["user.command.use", "chanop.command.use"]
                        },
                        {
                            "nick": "AnotherNick",
                            "hostmask": "AnotherNick!User@hostname.net",
                            "permissions": ["user.command.use", "chanop.command.use"]
                        },
                        {
                            "nick": "BannedNick",
                            "hostmask": "BannedNick!User@hostname.org",
                            "permissions": ["user.command.banned"] // This user is banned.
                        }
                    ],
                    "commandDelimiter": ".", // The command delimiter to use on this channel.
                    "mcBots": [ // The CraftIRC bots to register for this channel. The bots listed here are handled differently internally.
                        "IfYouHaveAnIRCBotForAMinecraftServerItGoesHere",
                        "YouCanHaveMultipleIRCBots"
                    ],
                    "floodProtection": {
                        "enabled": true, // Whether or not flood protection is enabled.
                        "secondsToReset": 30, // The amount of seconds before a user's violation level will completely reset.
                        "maxViolationLevel": 8, // The maximum violation level a user can have before being temporarily banned.
                        "penaltyMultiplier": 1.25 // The multiplier to use for penalizing a user if they continue trying to spam commands.
                    }
                },
                {
                    "name": "global", // The 'global' channel is used for private messages. If it is not present, things will not work.
                    "users": [
                        {
                            "nick": "Nick",
                            "hostmask": "Nick!User@hostname.com",
                            "permissions": ["user.command.use", "chanop.command.use", "netop.command.use", "root.command.use"] // Define users with network and root permissions here.
                        },
                        {
                            "nick": "BannedNick",
                            "hostmask": "BannedNick!User@hostname.org",
                            "permissions": ["user.command.banned"] // Users can be banned here, as well.
                        }
                    ],
                    "commandDelimiter": "."
                }
            ]
        }
    ],
    "google": {
        "apiKey": "PutYourGoogleAPIKeyHere" // API key to use for Google API-related commands. If non-existent, Google-related commands will be disabled.
        // See https://developers.google.com/console/help/ for more information on obtaining a Google API key.
    },
    "riot": {
        "apiKey": "PutYourRiotGamesAPIKeyHere" // API key to use for Riot Games API-related commands. If non-existent, League of Legends-related commands will be disabled.
        // See http://developer.riotgames.com/ for more information on obtaining a Riot Games API key.
    },
    "imgur": {
        "clientID": "PutYourImgurClientIDHere", // Client ID for imgur commands. If non-existent, imgur-related commands will be disabled.
        "clientSecret": "PutYourImgurClientSecretHere" // Client secret for imgur commands. If non-existent, imgur-related commands will be disabled.
        // See https://api.imgur.com/ for more information on getting imgur API authorization.
    },
    "git": {
        "listenForChanges": false, // Whether or not to even listen for push events.
        "autoUpdate": false, // Whether or not to automatically update to the latest code.
        "port": 4269, // The port to listen for git push events on.
        "repository": "AKP48", // The repository to listen for.
        "branch": "master", // The branch to listen for.
        "secret": "C#@ng3m3", // The secret to use for authenticating GitHub Webhooks.
        "path": "/github/callback" // The path to use for GitHub Webhooks.
    }
}